/**
 * @file lib.h
 * @brief Файл з описом функції для визначення повторів у масиві та виписування
 * їх у результуючий масив
 *
 * @author Sylka Michael
 * @date 17-may-2022
 * @version 1.0
 */

#include <stdlib.h>

/**
 * Функція визначає наявність у масиві повторів, якщо вони є - виписує їх у
 * результуючий масив у форматі: число - кількість його повторів у масиві
 *
 * @param a показжик на масив чисел
 * @param b довжина масиву
 * @param r показжик на результуючий масив
 * @param c покахжик на змінну для кінцевої довжини результуючого масиву
 */
void get_count(int *a, unsigned b, int *r, unsigned *c);